Revit 2024 API
ColorFillScheme.AreEntriesConsistentWithScheme Method
 Checks whether the entries can be set to the scheme or not.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2022
Syntax
C#
public EntryAndSchemeConsistency AreEntriesConsistentWithScheme(
	IList<ColorFillSchemeEntry> entries
)
Visual Basic
Public Function AreEntriesConsistentWithScheme ( _
	entries As IList(Of ColorFillSchemeEntry) _
) As EntryAndSchemeConsistency
Visual C++
public:
EntryAndSchemeConsistency AreEntriesConsistentWithScheme(
	IList<ColorFillSchemeEntry^>^ entries
)
Parameters
entries
Type: System.Collections.Generic.IList<ColorFillSchemeEntry>
 The entries to check.
Return Value
 The state of the entries and scheme consistency.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
ColorFillScheme Class
Autodesk.Revit.DB Namespace